In [13]:
import pandas as pd
import datetime as dt
employees=pd.read_csv("./pandas/pandas/Incomplete/employees.csv")

In [30]:
employees.info()
employees

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    category
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), category(1), datetime64[ns](1), float64(1), int64(1), object(3)
memory usage: 49.1+ KB

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,01:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,04:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,04:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,06:24:00,129949,10.169,True,Sales

In [20]:
employees["Start Date"]=pd.to_datetime(employees["Start Date"], format="%m/%d/%Y") #opisuje jaki format jest podany domyslnie, pomaga wnioskowac

In [29]:
employees

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,01:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,04:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,04:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,06:24:00,129949,10.169,True,Sales

In [26]:
employees["Last Login Time"]=pd.to_datetime(employees["Last Login Time"], format="%H:%M %p").dt.time #automatycznie tworzy time w odpowiednim formacie

In [27]:
employees["Senior Management"]=employees["Senior Management"].astype(bool)

In [28]:
employees["Gender"]=employees["Gender"].astype("category")

In [2]:
employees=pd.read_csv("./pandas/pandas/Incomplete/employees.csv", parse_dates=["Start Date"], date_format="%m/%d/%Y") #parametr który przetwarza od razu podana kolumne
employees["Last Login Time"]=pd.to_datetime(employees["Last Login Time"], format="%H:%M %p").dt.time
employees["Senior Management"]=employees["Senior Management"].astype(bool)
employees["Gender"]=employees["Gender"].astype("category")
employees.head()
employees.info()

NameError: name 'pd' is not defined

In [41]:
enea=pd.read_excel(r"C:\Users\deber\Downloads\Zadanie_rekrutacyjne.xlsx",sheet_name=2,parse_dates=["Data"],date_format="%d/%m/%Y")

C:\Dawid\Szkola\studia\ostatni_rozdzial\Github\python\Data Analysis with Pandas and Python\venv\Lib\site-packages\openpyxl\worksheet\_reader.py:332: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)
C:\Dawid\Szkola\studia\ostatni_rozdzial\Github\python\Data Analysis with Pandas and Python\venv\Lib\site-packages\openpyxl\worksheet\_reader.py:332: UserWarning: Conditional Formatting extension is not supported and will be removed
  warn(msg)

In [43]:
enea

                    Data  Cena BASE-Y 24  Wolumen BASE Y-24
0    2021-01-08 00:00:00          266.25                  2
1    2021-01-11 00:00:00          269.50                  0
2    2021-01-12 00:00:00          269.00                  0
3    2021-01-13 00:00:00          263.00                  1
4    2021-01-14 00:00:00          262.00                  1
..                   ...             ...                ...
749  2023-12-21 00:00:00          500.65                 20
750  2023-12-22 00:00:00          501.67                  3
751  2023-12-27 00:00:00          503.50                  2
752  2023-12-28 00:00:00          493.80                  5
753  2023-12-29 00:00:00          489.00                  6

[754 rows x 3 columns]

In [45]:
enea.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 754 entries, 0 to 753
Data columns (total 3 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Data               754 non-null    object
 1   Cena BASE-Y 24     754 non-null    float64
 2   Wolumen BASE Y-24  754 non-null    int64
dtypes: float64(1), int64(1), object(1)
memory usage: 17.8+ KB

In [54]:
#enea.dropna(how='')
sprzedaz=enea["Cena BASE-Y 24"]*enea['Wolumen BASE Y-24']
enea["Sprzedaż"]=sprzedaz
enea["Data"]=="%2022%"

0      False
1      False
2      False
3      False
4      False
       ...
749    False
750    False
751    False
752    False
753    False
Name: Data, Length: 754, dtype: bool

In [70]:
employees[employees["Gender"]=="Male"]
employees[employees["Team"]=="Finance"]
on_finance=employees["Team"]=="Finance"
employees[on_finance]
employees["Senior Management"]==True #it does not change anythig 'cos its already boolean
employees[employees["Senior Management"]].head()
employees[employees["Salary"]>10000]
employees[employees["Bonus %"]<1.5]
employees[employees["Start Date"] < "1985-01-01"]
employees[employees["Last Login Time"]<dt.time(12,0,0)] #12 hours 0 minutes 0 seconds noon

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,01:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,04:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,05:47:00,98874,4.479,True,Marketing
995,Henry,NaN,2014-11-23,06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,06:30:00,42392,19.675,False,Finance
998,Larry,Male,2013-04-20,04:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,06:24:00,129949,10.169,True,Sales

In [77]:
#combing conditionios 
#is female employee who work in Marketing
is_female=employees["Gender"]=="Female"
is_in_marketing=employees["Team"]=="Marketing" 
salary_over_100k=employees["Salary"]>100000

In [78]:
employees[is_female & is_in_marketing&salary_over_100k] #filtrowanie

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
98,Tina,Female,2016-06-16,07:47:00,100705,16.961,True,Marketing
140,Shirley,Female,1981-02-28,01:23:00,113850,1.854,False,Marketing
158,Norma,Female,1999-02-28,08:45:00,114412,8.756,True,Marketing
305,Margaret,Female,1993-02-06,01:05:00,125220,3.733,False,Marketing
319,Jacqueline,Female,1981-11-25,03:01:00,145988,18.243,False,Marketing
379,NaN,Female,2002-09-18,12:39:00,118906,4.537,True,Marketing
468,Janice,Female,1997-06-28,01:48:00,136032,10.696,True,Marketing
490,Judith,Female,2007-11-23,01:22:00,117055,7.461,False,Marketing
531,Virginia,Female,2010-05-02,09:10:00,123649,10.154,True,Marketing
585,Shirley,Female,1988-04-16,11:09:00,132156,2.754,False,Marketing
627,Anne,Female,1984-11-21,12:30:00,128305,16.636,False,Marketing
656,Lisa,Female,1982-02-09,06:44:00,113592,17.108,True,Marketing
675,Diane,Female,2009-10-30,06:56:00,130577,12.791,False,Marketing
676,Annie,Female,1992-06-06,10:04:00,138925,9.801,True,Marketing
811,Judith,Female,1989-09-03,11:16:00,134048,6.818,True,Marketing
813,Evelyn,Female,2002-02-10,04:44:00,123621,19.767,True,Marketing
881,Ruby,Female,1980-01-28,11:08:00,142868,6.318,False,Marketing
991,Rose,Female,2002-08-25,05:12:00,134505,11.051,True,Marketing

In [76]:
is_female & is_in_marketing
#True, False -> False

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [81]:
target=employees["Team"].isin(["Legal","Sales","Product"])
employees[target]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,1987-04-18,01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,04:20:00,65476,10.012,True,Product
11,Julie,Female,1997-10-26,03:19:00,102508,12.637,True,Legal
13,Gary,Male,2008-01-27,11:40:00,109831,5.831,False,Sales
15,Lillian,Female,2016-06-05,06:09:00,59414,1.256,False,Product
...,...,...,...,...,...,...,...,...
981,James,Male,1993-01-15,05:19:00,148985,19.280,False,Legal
985,Stephen,NaN,1983-07-10,08:10:00,85668,1.909,False,Legal
989,Justin,NaN,1991-02-10,04:58:00,38344,3.794,False,Legal
997,Russell,Male,2013-05-20,12:39:00,96914,1.421,False,Product
999,Albert,Male,2012-05-15,06:24:00,129949,10.169,True,Sales

In [83]:
employees["Team"].isnull()
employees[employees["Team"].isnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,04:19:00,125792,5.042,True,NaN
32,NaN,Male,1998-08-21,02:27:00,122340,6.417,True,NaN
91,James,NaN,2005-01-26,11:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,01:08:00,132373,10.527,True,NaN
199,Jonathan,Male,2009-07-17,08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,06:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,05:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,03:57:00,107024,12.182,True,NaN
434,Joyce,Female,1995-02-07,07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,02:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,07:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,08:04:00,48141,12.605,True,NaN
573,Kimberly,Female,1981-12-30,04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,08:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,08:03:00,131755,2.930,True,NaN
634,Carl,Male,1987-03-30,05:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,01:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,05:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,06:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,10:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,07:36:00,106428,10.867,True,NaN
781,Lawrence,Male,1995-07-03,10:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,05:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,01:35:00,87103,5.665,True,NaN
850,Charles,Male,1997-09-03,10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,10:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,01:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,05:19:00,143638,9.662,True,NaN

In [90]:
employees["First Name"].isnull()
employees["Team"].notnull()
employees[employees["First Name"].isnull() & employees["Team"].notnull()]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
7,NaN,Female,2015-07-20,10:43:00,45906,11.598,True,Finance
25,NaN,Male,2012-10-08,01:12:00,37076,18.576,True,Client Services
39,NaN,Male,2016-01-29,02:33:00,122173,7.797,True,Client Services
51,NaN,NaN,2011-12-17,08:29:00,41126,14.009,True,Sales
62,NaN,Female,2007-06-12,05:25:00,58112,19.414,True,Marketing
116,NaN,Male,1991-06-22,08:58:00,76189,18.988,True,Legal
149,NaN,Female,2014-08-17,02:00:00,86230,8.578,True,Distribution
157,NaN,Female,2005-07-27,08:32:00,79536,14.443,True,Product
165,NaN,Female,2014-03-23,01:28:00,59148,9.061,True,Legal
166,NaN,Female,1991-07-09,06:52:00,42341,7.014,True,Sales
174,NaN,NaN,2007-09-18,06:59:00,40297,6.185,True,Client Services
186,NaN,Female,2005-02-23,09:50:00,149654,1.825,True,Sales
220,NaN,Female,1991-06-17,12:49:00,71945,5.560,True,Marketing
253,NaN,NaN,2003-04-28,03:01:00,113732,10.391,True,Sales
257,NaN,Male,1999-11-25,06:16:00,42676,15.517,True,Sales
266,NaN,Female,2009-08-05,08:14:00,115145,14.063,True,Distribution
267,NaN,Male,2005-02-04,01:01:00,40451,16.044,True,Distribution
269,NaN,Female,1992-08-02,08:35:00,145316,18.517,True,Human Resources
320,NaN,Female,2008-07-08,11:40:00,62960,14.356,True,Sales
329,NaN,Male,2010-01-27,02:57:00,87760,14.987,True,Engineering
352,NaN,Male,2011-10-09,09:29:00,69906,4.844,True,Engineering
353,NaN,Male,1997-04-22,09:36:00,65078,3.095,True,Marketing
374,NaN,Female,2006-12-31,11:02:00,81444,3.171,True,Distribution
379,NaN,Female,2002-09-18,12:39:00,118906,4.537,True,Marketing
416,NaN,Male,2008-06-29,05:23:00,111043,5.966,True,Distribution
444,NaN,Male,2016-05-24,09:17:00,76409,7.008,True,Distribution
454,NaN,Male,1995-02-21,12:26:00,136602,10.429,True,Marketing
481,NaN,Female,2013-04-27,06:40:00,93847,1.085,True,Business Development
483,NaN,Female,1992-04-26,08:01:00,115436,3.099,True,Human Resources
504,NaN,Female,2014-06-24,10:05:00,38275,10.494,True,Distribution
505,NaN,Male,1980-04-20,01:17:00,71520,13.248,True,Engineering
521,NaN,NaN,1981-09-25,09:59:00,83895,17.971,True,Engineering
540,NaN,Female,2009-12-02,03:30:00,84746,4.820,True,Finance
574,NaN,Female,2009-01-13,01:01:00,118736,7.421,True,Client Services
599,NaN,Female,1990-10-11,10:57:00,98385,10.925,True,Human Resources
607,NaN,Male,1983-10-13,11:59:00,139754,12.740,True,Sales
608,NaN,Female,1993-10-24,05:17:00,116236,17.274,True,Engineering
628,NaN,NaN,1988-09-02,12:49:00,147309,1.702,True,Distribution
674,NaN,Male,2012-08-28,07:56:00,88733,1.932,True,Human Resources
685,NaN,Male,1989-10-20,09:37:00,88086,19.387,True,Finance
687,NaN,Male,1996-12-27,07:07:00,139959,8.992,True,Distribution
697,NaN,Male,1990-05-23,02:09:00,136655,9.801,True,Distribution
709,NaN,Male,1995-04-07,04:32:00,60411,12.048,True,Human Resources
733,NaN,Male,2009-06-17,01:00:00,136681,3.655,True,Business Development
734,NaN,Female,1994-12-18,08:42:00,138807,1.400,True,Human Resources
773,NaN,Male,1986-10-24,09:23:00,47176,10.736,True,Finance
782,NaN,Male,1986-05-06,04:41:00,74104,17.680,True,Client Services
783,NaN,NaN,1991-04-15,03:39:00,132505,13.592,True,Product
785,NaN,Female,1982-07-24,12:00:00,57811,8.941,True,Marketing
812,NaN,Male,1994-12-13,10:34:00,141311,5.478,True,Product
821,NaN,Female,1980-12-27,02:27:00,80399,12.254,True,Distribution
823,NaN,Male,2009-11-12,02:30:00,109411,9.494,True,Engineering
877,NaN,Male,1980-09-05,07:36:00,114896,13.823,True,Client Services
890,NaN,Male,2015-11-24,03:11:00,145329,7.100,True,Finance
902,NaN,Male,2001-05-23,07:52:00,103877,6.322,True,Distribution
925,NaN,Female,2000-08-23,04:19:00,95866,19.388,True,Sales
946,NaN,Female,1985-09-15,01:50:00,133472,16.941,True,Distribution
947,NaN,Male,2012-07-30,03:07:00,107351,5.329,True,Marketing

In [92]:
employees[employees["Bonus %"].between(2,5)]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,06:53:00,61933,4.170,True,NaN
20,Lois,NaN,1995-04-22,07:18:00,64714,4.934,True,Legal
40,Michael,Male,2008-10-10,11:25:00,99283,2.665,True,Distribution
49,Chris,NaN,1980-01-24,12:13:00,113590,3.055,False,Sales
60,Paula,NaN,2005-11-23,02:01:00,48866,4.271,False,Distribution
...,...,...,...,...,...,...,...,...
943,Wayne,Male,2006-09-08,11:09:00,67471,2.728,False,Engineering
961,Antonio,NaN,1989-06-18,09:37:00,103050,3.050,False,Legal
976,Denise,Female,1992-10-19,05:42:00,137954,4.195,True,Legal
989,Justin,NaN,1991-02-10,04:58:00,38344,3.794,False,Legal
994,George,Male,2013-06-21,05:47:00,98874,4.479,True,Marketing

In [ ]:
import datetime as dt

In [94]:
employees[employees["Last Login Time"].between(dt.time(8,30), dt.time(12,0))] #between 8:30 and noon 12

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,10:43:00,45906,11.598,True,Finance
10,Louise,Female,1980-08-12,09:01:00,63241,15.132,True,NaN
13,Gary,Male,2008-01-27,11:40:00,109831,5.831,False,Sales
18,Diana,Female,1981-10-23,10:27:00,132940,19.082,False,Client Services
...,...,...,...,...,...,...,...,...
977,Sarah,Female,1995-12-04,09:16:00,124566,5.949,False,Product
982,Rose,Female,1982-04-06,10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,10:35:00,146907,11.738,False,Engineering
988,Alice,Female,2004-10-05,09:34:00,47638,11.209,False,Human Resources
992,Anthony,Male,2011-10-16,08:35:00,112769,11.625,True,Finance

In [16]:
#duplicated values
employees[employees["First Name"].duplicated()]
employees[employees["First Name"].duplicated("first")]
employees[employees["First Name"].duplicated("last")] #zaczyna sprawdzać od końca
#wyswietla duplikaty

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
959,Albert,Male,9/19/1992,2:35 AM,45094,5.850,True,Business Development
960,Stephen,Male,10/29/1989,11:34 PM,93997,18.093,True,Business Development
970,Alice,Female,9/3/1988,8:54 PM,63571,15.397,True,Product
973,Russell,Male,5/10/2013,11:08 PM,137359,11.105,False,Business Development
982,Rose,Female,4/6/1982,10:43 AM,91411,8.639,True,Human Resources

In [15]:
employees[employees["First Name"].duplicated(keep=False)] #all values occured 2,3,4 times are marked as duplicates
#wyswietla dupliaktry razem z pierwszymi

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [17]:
employees["First Name"].duplicated(keep=False) #false are the rows we want to keep, false are unique names
employees[~employees["First Name"].duplicated(keep=False)] #inverted, only values that are unique 
#wyswietla tabele bez dupliaktow

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
33,Jean,Female,12/18/1993,9:07 AM,119082,16.180,False,Business Development
190,Carol,Female,3/19/1996,3:39 AM,57783,9.129,False,Finance
291,Tammy,Female,11/11/1984,10:30 AM,132839,17.463,True,Client Services
495,Eugene,Male,5/24/1984,10:54 AM,81077,2.117,False,Sales
688,Brian,Male,4/7/2007,10:47 PM,93901,17.821,True,Legal
832,Keith,Male,2/12/2003,3:02 PM,120672,19.467,False,Legal
887,David,Male,12/5/2009,8:48 AM,92242,15.407,False,Legal

In [18]:
employees.drop_duplicates() #porownuje cale wiersze do siebie
employees.drop_duplicates("Team") #drop rows that have same value in Team column

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development
12,Brandon,Male,12/1/1980,1:08 AM,112807,17.492,True,Human Resources
13,Gary,Male,1/27/2008,11:40 PM,109831,5.831,False,Sales
40,Michael,Male,10/10/2008,11:25 AM,99283,2.665,True,Distribution

In [21]:
employees.drop_duplicates("Team", keep="first")
employees.drop_duplicates("Team", keep="last")
employees.drop_duplicates("Team", keep=False) #wyswietla wartosci ktore ani razu się nie powtorzyly, jako ze to dzialy wiec kazdy ma powtarzaajce sie

employees.drop_duplicates("First Name", keep=False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
33,Jean,Female,12/18/1993,9:07 AM,119082,16.180,False,Business Development
190,Carol,Female,3/19/1996,3:39 AM,57783,9.129,False,Finance
291,Tammy,Female,11/11/1984,10:30 AM,132839,17.463,True,Client Services
495,Eugene,Male,5/24/1984,10:54 AM,81077,2.117,False,Sales
688,Brian,Male,4/7/2007,10:47 PM,93901,17.821,True,Legal
832,Keith,Male,2/12/2003,3:02 PM,120672,19.467,False,Legal
887,David,Male,12/5/2009,8:48 AM,92242,15.407,False,Legal

In [25]:
employees.drop_duplicates(["Senior Management","Team"]).sort_values("Team") #both senior mngm and team must be the same to be discarded
employees.drop_duplicates(["Senior Management","Team"], keep="last").sort_values("Team")

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
733,NaN,Male,6/17/2009,1:00 PM,136681,3.655,NaN,Business Development
971,Patrick,Male,12/30/2002,2:01 AM,75423,5.368,True,Business Development
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
877,NaN,Male,9/5/1980,7:36 AM,114896,13.823,NaN,Client Services
965,Catherine,Female,9/25/1989,1:31 AM,68164,18.393,False,Client Services
990,Robin,Female,7/24/1987,1:35 PM,100765,10.982,True,Client Services
946,NaN,Female,9/15/1985,1:50 AM,133472,16.941,NaN,Distribution
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
945,Gerald,NaN,4/15/1989,12:44 PM,93712,17.426,True,Distribution
984,Maria,Female,10/15/2011,4:53 PM,43455,13.040,False,Engineering
823,NaN,Male,11/12/2009,2:30 PM,109411,9.494,NaN,Engineering
993,Tina,Female,5/15/1997,3:53 PM,56450,19.040,True,Engineering
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
890,NaN,Male,11/24/2015,3:11 AM,145329,7.100,NaN,Finance
992,Anthony,Male,10/16/2011,8:35 AM,112769,11.625,True,Finance
982,Rose,Female,4/6/1982,10:43 AM,91411,8.639,True,Human Resources
988,Alice,Female,10/5/2004,9:34 AM,47638,11.209,False,Human Resources
734,NaN,Female,12/18/1994,8:42 PM,138807,1.400,NaN,Human Resources
989,Justin,NaN,2/10/1991,4:58 PM,38344,3.794,False,Legal
165,NaN,Female,3/23/2014,1:28 PM,59148,9.061,NaN,Legal
976,Denise,Female,10/19/1992,5:42 AM,137954,4.195,True,Legal
947,NaN,Male,7/30/2012,3:07 PM,107351,5.329,NaN,Marketing
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
986,Donna,Female,11/26/1982,7:04 AM,82871,17.999,False,Marketing
979,Ernest,Male,7/20/2013,6:41 AM,142935,13.198,True,Product
812,NaN,Male,12/13/1994,10:34 AM,141311,5.478,NaN,Product
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
975,Susan,Female,4/7/1995,10:05 PM,92436,12.467,False,Sales
925,NaN,Female,8/23/2000,4:19 PM,95866,19.388,NaN,Sales
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales
855,Phillip,NaN,10/20/2003,11:09 AM,89700,2.277,True,NaN
912,Joe,Male,12/8/1998,10:28 AM,126120,1.020,False,NaN
951,NaN,Female,9/14/2010,5:19 AM,143638,9.662,NaN,NaN

In [28]:
employees["Gender"].unique()
type(employees["Gender"].unique())

numpy.ndarray

In [30]:
employees["Team"].unique()
type(employees["Team"].unique())

numpy.ndarray

In [31]:
employees["Team"].nunique() #counts all unique rows

10

In [35]:
employees["Team"].nunique(dropna=True) #10
employees["Team"].nunique(dropna=False) #11

11

In [36]:
employees.nunique()

First Name           200
Gender                 2
Start Date           972
Last Login Time      720
Salary               995
Bonus %              971
Senior Management      2
Team                  10
dtype: int64